Repository: KiYouJyo/SpatialViewer
Catalog: src/SpatialViewer.App/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# AppName
source: Spatial Viewer
ja_jp: 図覧
zh_cn: 图览

source: Home
ja_jp: ホーム
zh_cn: 主页

source: Open file
ja_jp: ファイルを開く
zh_cn: 打开文件

# NotImplemented
source: Not implemented yet
ja_jp: 未実装
zh_cn: 暂未实现

# Nav_Home
source: Home
ja_jp: ホーム
zh_cn: 主页

# Nav_Projects
source: Projects
ja_jp: プロジェクト
zh_cn: 项目

# Nav_Favorites
source: Favorites
ja_jp: お気に入り
zh_cn: 收藏

# Nav_ImportFolder
source: Import folder
ja_jp: フォルダーを読み込む
zh_cn: 导入文件夹

# Nav_About
source: About Spatial Viewer
ja_jp: 図覧について
zh_cn: 关于图览

# Nav_Settings
source: Settings
ja_jp: 設定
zh_cn: 设置

# NavHome.Content
source: Home
ja_jp: ホーム
zh_cn: 主页

# NavProjects.Content
source: Projects
ja_jp: プロジェクト
zh_cn: 项目

# NavFavorites.Content
source: Favorites
ja_jp: お気に入り
zh_cn: 收藏

# NavImportFolder.Content
source: Import folder
ja_jp: フォルダーを読み込む
zh_cn: 导入文件夹

# NavAbout.Content
source: About Spatial Viewer
ja_jp: 図覧について
zh_cn: 关于图览

# NavSettings.Content
source: Settings
ja_jp: 設定
zh_cn: 设置

# Shell_NewHomeTab
source: New Home tab
ja_jp: 新しいホームタブ
zh_cn: 新建主页标签

# HomeTitle.Text
source: Spatial Viewer
ja_jp: 図覧
zh_cn: 图览

# HomeOpenFile.Text
source: Open file
ja_jp: ファイルを開く
zh_cn: 打开文件

# HomeQuickOpen.Text
source: Quick open
ja_jp: クイックオープン
zh_cn: 快速打开

# HomeDropZone.Text
source: Drop a drawing, spatial dataset, or model here
ja_jp: 図面、空間データ、またはモデルをここにドロップ
zh_cn: 将图纸、空间数据或模型拖到这里

# HomeSupportedWorkflows.Text
source: Supported workflows
ja_jp: 対応ワークフロー
zh_cn: 支持的工作流

# HomeRecent.Text
source: Recently opened
ja_jp: 最近開いたファイル
zh_cn: 最近打开

# HomeRecentCompact.Text
source: Recently opened
ja_jp: 最近開いたファイル
zh_cn: 最近打开

# HomeSearchRecent.PlaceholderText
source: Search recent files
ja_jp: 最近のファイルを検索
zh_cn: 搜索最近文件

# HomeSearchRecentCompact.PlaceholderText
source: Search recent files
ja_jp: 最近のファイルを検索
zh_cn: 搜索最近文件

# HomeEmptyState.Text
source: No files have been opened yet. Use the button or drop area above to open DWG / DXF / 3DM.
ja_jp: まだファイルを開いていません。上のボタンまたはドロップ領域から DWG / DXF / 3DM を開いてください。
zh_cn: 尚未打开任何文件。使用上方按钮或拖放区域打开 DWG / DXF / 3DM。

# Home_Filter_All
source: All
ja_jp: すべて
zh_cn: 全部

# Home_Workflow_Cad_Tooltip
source: Open a CAD file
ja_jp: CAD ファイルを開く
zh_cn: 打开 CAD 文件

# Home_Workflow_Rhino_Tooltip
source: Open a Rhino 3DM model
ja_jp: Rhino 3DM モデルを開く
zh_cn: 打开 Rhino 3DM 模型

# Home_Workflow_Planned
source: In development
ja_jp: 開発中
zh_cn: 开发中

# Home_OpenFile_Automation
source: Open a DWG, DXF, or Rhino 3DM file
ja_jp: DWG、DXF、または Rhino 3DM ファイルを開く
zh_cn: 打开 DWG、DXF 或 Rhino 3DM 文件

# Home_Date_Today
source: Today {0:HH:mm}
ja_jp: 今日 {0:HH:mm}
zh_cn: 今天 {0:HH:mm}

# Home_Date_Yesterday
source: Yesterday
ja_jp: 昨日
zh_cn: 昨天

# Home_Date_Format
source: MMM d
ja_jp: M月d日
zh_cn: M月d日

# Placeholder_Projects_Title
source: Projects
ja_jp: プロジェクト
zh_cn: 项目

# Placeholder_Projects_Message
source: Project workflows will be available in a later release.
ja_jp: プロジェクトのワークフローは今後のバージョンで提供します。
zh_cn: 项目工作流将在后续版本提供。

# Placeholder_Favorites_Title
source: Favorites
ja_jp: お気に入り
zh_cn: 收藏

# Placeholder_Favorites_Message
source: Favorites will be available in a later release.
ja_jp: お気に入り機能は今後のバージョンで提供します。
zh_cn: 收藏夹将在后续版本提供。

# Placeholder_ImportFolder_Title
source: Import folder
ja_jp: フォルダーを読み込む
zh_cn: 导入文件夹

# Placeholder_ImportFolder_Message
source: Folder import will be available in a later release.
ja_jp: フォルダー読み込みは今後のバージョンで提供します。
zh_cn: 文件夹导入将在后续版本提供。

# Settings_Title
source: Settings
ja_jp: 設定
zh_cn: 设置

# Settings_AppearanceLanguage
source: Appearance & language
ja_jp: 外観と言語
zh_cn: 外观与语言

# Settings_Theme_Title
source: Theme
ja_jp: テーマ
zh_cn: 主题

# Settings_Theme_Desc
source: Choose light, dark, or follow the system. Theme changes apply immediately.
ja_jp: ライト、ダーク、またはシステム設定を選択します。変更はすぐに反映されます。
zh_cn: 选择浅色、深色或跟随系统。主题更改立即生效。

# Theme_System
source: Use system setting
ja_jp: システム設定を使用
zh_cn: 跟随系统

# Theme_Light
source: Light
ja_jp: ライト
zh_cn: 浅色

# Theme_Dark
source: Dark
ja_jp: ダーク
zh_cn: 深色

# Settings_Language_Title
source: Language
ja_jp: 言語
zh_cn: 语言

# Settings_Language_Desc
source: Choose the interface language. The current UI is rebuilt and your location is restored without restarting the app.
ja_jp: 表示言語を選択します。現在の画面を再構築して位置を復元するため、アプリの再起動は不要です。
zh_cn: 选择界面语言。切换后会重建当前界面并恢复所在位置，无需重启应用。

# Language_System
source: Use system setting
ja_jp: システム設定を使用
zh_cn: 跟随系统

# Settings_FileSession
source: Files & session
ja_jp: ファイルとセッション
zh_cn: 文件与会话

# Settings_Restore_Title
source: Restore the previous session at startup
ja_jp: 起動時に前回のセッションを復元
zh_cn: 启动时恢复上次会话

# Settings_Restore_Desc
source: Reopen drawings that were still in the session when the app last exited.
ja_jp: 前回終了時にセッションに残っていた図面を再度開きます。
zh_cn: 重新打开上次退出时仍在会话中的图纸。

# Settings_Recent_Title
source: Remember recently opened files
ja_jp: 最近開いたファイルを記録
zh_cn: 记录最近打开文件

# Settings_Recent_Desc
source: Store recent file paths locally for quick access from Home.
ja_jp: 最近のファイルパスをこの端末にのみ保存し、ホームからすばやく開けるようにします。
zh_cn: 仅在本机保存最近文件路径，用于主页快速访问。

# Settings_Watch_Title
source: Automatically check for file changes
ja_jp: ファイル変更を自動確認
zh_cn: 自动检查文件变化

# Settings_Watch_Desc
source: Reload an open drawing after it is modified externally.
ja_jp: 開いている図面が外部で変更された場合に自動で再読み込みします。
zh_cn: 打开的图纸被外部修改后自动重新读取。

# Settings_Viewer
source: Viewer
ja_jp: ビューアー
zh_cn: 查看器

# Settings_Fit_Title
source: Fit to window after opening a file
ja_jp: ファイルを開いた後にウィンドウへフィット
zh_cn: 打开文件后适合窗口

# Settings_Fit_Desc
source: Fit all objects when a drawing is first displayed.
ja_jp: 図面を初めて表示するときに全オブジェクトへ自動ズームします。
zh_cn: 首次显示图纸时自动缩放到全部对象。

# Settings_DrawingBackground_Title
source: Drawing background
ja_jp: 図面の背景色
zh_cn: 图纸背景颜色

# Settings_DrawingBackground_Desc
source: Follow the app theme or always use a black or white canvas.
ja_jp: アプリのテーマに従うか、黒または白のキャンバスに固定します。
zh_cn: 跟随应用主题，或固定使用黑色/白色画布。

# DrawingBackground_Follow
source: Follow app
ja_jp: アプリに従う
zh_cn: 跟随应用

# DrawingBackground_Dark
source: Black
ja_jp: 黒
zh_cn: 黑色

# DrawingBackground_Light
source: White
ja_jp: 白
zh_cn: 白色

# Language_SwitchFailed
source: Could not switch language
ja_jp: 言語を切り替えられませんでした
zh_cn: 语言切换失败

# CadLayersTitle.Text
source: Layers
ja_jp: レイヤー
zh_cn: 图层

# CadPropertiesTitle.Text
source: Properties
ja_jp: プロパティ
zh_cn: 属性

# CadPropertiesEmptyOverlay.Text
source: Select an object to view its CAD properties.
ja_jp: オブジェクトを選択すると CAD プロパティを表示します。
zh_cn: 选择一个对象以查看真实 CAD 属性。

# CadLayersButton.Label
source: Layers
ja_jp: レイヤー
zh_cn: 图层

# CadSelectButton.Label
source: Select
ja_jp: 選択
zh_cn: 选择

# CadPanButton.Label
source: Pan
ja_jp: パン
zh_cn: 平移

# CadFitButton.Label
source: Fit
ja_jp: 全体表示
zh_cn: 适合窗口

# CadDistanceButton.Label
source: Distance
ja_jp: 距離
zh_cn: 测距

# CadAreaButton.Label
source: Area
ja_jp: 面積
zh_cn: 面积

# CadCoordinateButton.Label
source: Coordinates
ja_jp: 座標
zh_cn: 坐标

# CadDisplayButton.Label
source: Display
ja_jp: 表示
zh_cn: 显示

# CadPropertiesButton.Label
source: Properties
ja_jp: プロパティ
zh_cn: 属性

# CadLayerSegment.Content
source: Layers
ja_jp: レイヤー
zh_cn: 图层

# CadLayoutSegment.Content
source: Layouts (not supported yet)
ja_jp: レイアウト（未対応）
zh_cn: 布局（暂未支持）

# CadPropertiesPanelTitle.Text
source: Properties
ja_jp: プロパティ
zh_cn: 属性

# CadPropertiesEmpty.Text
source: Select an object to view its CAD properties.
ja_jp: オブジェクトを選択すると CAD プロパティを表示します。
zh_cn: 选择一个对象以查看真实 CAD 属性。

# CadDiagnosticsBar.Title
source: The drawing contains unsupported objects
ja_jp: 図面に未対応のオブジェクトがあります
zh_cn: 图纸包含暂不支持的对象

# Cad_Status_FileChanged
source: File change detected. Reloading…
ja_jp: ファイルの変更を検出しました。再読み込み中…
zh_cn: 检测到文件变化，正在重新读取…

# Cad_Status_OpeningFile
source: Opening {0}…
ja_jp: {0} を開いています…
zh_cn: 正在打开 {0}…

# Cad_Status_OpenFailed
source: Could not open this file.
ja_jp: このファイルを開けませんでした。
zh_cn: 无法打开此文件。

# Cad_Status_Zoom
source: Zoom {0:G4}
ja_jp: ズーム {0:G4}
zh_cn: 缩放 {0:G4}

# Cad_Unitless
source: Unitless
ja_jp: 単位なし
zh_cn: 无单位

# Cad_Status_SkippedObjects
source: Skipped {0} unsupported objects
ja_jp: 未対応のオブジェクト {0} 件をスキップしました
zh_cn: 已跳过 {0} 个暂不支持的对象

# Cad_Status_FileReloaded
source: File reloaded
ja_jp: ファイルを再読み込みしました
zh_cn: 文件已重新读取

# About_Title
source: About Spatial Viewer
ja_jp: 図覧について
zh_cn: 关于图览

# About_Tagline
source: A unified viewer for architecture, planning, and spatial data
ja_jp: 建築・都市計画・空間データの統合ビューアー
zh_cn: 建筑、规划与空间数据统一查看器

# About_DisplayVersion
source: Display version
ja_jp: 表示バージョン
zh_cn: 显示版本

# About_Channel
source: Release channel
ja_jp: 配布チャネル
zh_cn: 发布渠道

# About_InternalVersion
source: Internal version
ja_jp: 内部バージョン
zh_cn: 内部版本

# About_Publisher
source: Publisher
ja_jp: 発行者
zh_cn: 发行者

# About_Architecture
source: Architecture
ja_jp: アーキテクチャ
zh_cn: 当前架构

# About_TechStack
source: Technology
ja_jp: 技術スタック
zh_cn: 技术栈

# About_UpdateManagement
source: Update management
ja_jp: 更新管理
zh_cn: 更新管理

# About_AppProgram
source: SpatialViewer application
ja_jp: SpatialViewer 本体
zh_cn: SpatialViewer 主程序

# About_AppUpdate
source: Application update
ja_jp: アプリ更新
zh_cn: 应用更新

# About_CurrentVersion
source: Current version
ja_jp: 現在のバージョン
zh_cn: 当前版本

# About_AvailableVersion
source: Available version
ja_jp: 利用可能なバージョン
zh_cn: 可用版本

# About_UpdateSource
source: Update source
ja_jp: 更新元
zh_cn: 更新来源

# About_Status
source: Status
ja_jp: 状態
zh_cn: 状态

# About_ReleaseNotes
source: Release notes
ja_jp: リリースノート
zh_cn: 发行说明

# About_CheckUpdates
source: Check for updates
ja_jp: 更新を確認
zh_cn: 检查更新

# About_Kernels
source: Viewer kernels
ja_jp: ビューアーカーネル
zh_cn: 查看内核

# About_CadCore_Desc
source: CAD graphics kernel · SpatialViewer.CadCore
ja_jp: CAD グラフィックスカーネル · SpatialViewer.CadCore
zh_cn: CAD 图形内核 · SpatialViewer.CadCore

# About_ProjectOpenSource
source: Project & open source
ja_jp: プロジェクトとオープンソース
zh_cn: 项目与开源

# About_Repository
source: GitHub repository
ja_jp: GitHub リポジトリ
zh_cn: GitHub 仓库

# About_Repository_Desc
source: View source code, README, and development progress.
ja_jp: ソースコード、README、開発状況を確認します。
zh_cn: 查看源码、README 与开发进度。

# About_OpenRepository
source: Open repository
ja_jp: リポジトリを開く
zh_cn: 打开仓库

# About_Releases_Desc
source: View previous versions, installers, and release notes.
ja_jp: 過去のバージョン、インストーラー、リリースノートを確認します。
zh_cn: 查看历史版本、安装包与发行说明。

# About_ViewVersions
source: View releases
ja_jp: リリースを見る
zh_cn: 查看版本

# About_LicensePrivacy
source: Licensing & privacy
ja_jp: ライセンスとプライバシー
zh_cn: 许可与隐私

# About_LicensePrivacy_Desc
source: Review third-party licenses and local-file handling.
ja_jp: 第三者ライセンスとローカルファイルの取り扱いを確認します。
zh_cn: 查看第三方组件许可与本地文件策略。

# About_ViewInfo
source: View information
ja_jp: 説明を見る
zh_cn: 查看说明

# KernelPlanned1.Text
source: Planned
ja_jp: 計画中
zh_cn: 计划中

# KernelPlanned2.Text
source: Planned
ja_jp: 計画中
zh_cn: 计划中

# KernelPlanned3.Text
source: Planned
ja_jp: 計画中
zh_cn: 计划中

# KernelSourcePlanned1.Text
source: Reserved source
ja_jp: 独立ソース予定
zh_cn: 预留独立源

# KernelSourcePlanned2.Text
source: Reserved source
ja_jp: 独立ソース予定
zh_cn: 预留独立源

# KernelSourcePlanned3.Text
source: Reserved source
ja_jp: 独立ソース予定
zh_cn: 预留独立源

# KernelStatusPlanned1.Text
source: Not connected
ja_jp: 未接続
zh_cn: 尚未接入

# KernelStatusPlanned2.Text
source: Not connected
ja_jp: 未接続
zh_cn: 尚未接入

# KernelStatusPlanned3.Text
source: Not connected
ja_jp: 未接続
zh_cn: 尚未接入

# Update_NotChecked
source: Not checked
ja_jp: 未確認
zh_cn: 尚未检查

# Update_Checking
source: Checking…
ja_jp: 確認中…
zh_cn: 正在检查…

# Update_NoRelease
source: No GitHub Release is available
ja_jp: GitHub Release はありません
zh_cn: 暂无 GitHub Release

# Update_NewVersion
source: A new version is available
ja_jp: 新しいバージョンがあります
zh_cn: 发现新版本

# Update_Latest
source: You have the latest preview
ja_jp: 最新のプレビューです
zh_cn: 已是最新版本

# Update_NetworkFailed
source: Network check failed
ja_jp: ネットワーク確認に失敗しました
zh_cn: 网络检查失败

# Update_Timeout
source: Update check timed out
ja_jp: 更新確認がタイムアウトしました
zh_cn: 检查超时

# Update_CadNoRelease
source: No CadCore Release is available
ja_jp: CadCore Release はありません
zh_cn: 暂无 CadCore Release

# Update_CadUpToDate
source: The kernel is up to date
ja_jp: 最新バージョンです
zh_cn: 已是最新版本

# Update_CadAvailable
source: A kernel update is available
ja_jp: カーネル更新があります
zh_cn: 发现内核更新

# Update_CadDownloading
source: Downloading the kernel update…
ja_jp: カーネル更新をダウンロード中…
zh_cn: 正在下载内核更新…

# Update_CadVerifying
source: Verifying and preparing the kernel update…
ja_jp: カーネル更新を検証して準備中…
zh_cn: 正在验证并准备内核更新…

# Update_CadReadyRestart
source: Update downloaded. Restart the app to apply it
ja_jp: 更新をダウンロードしました。アプリを再起動すると反映されます
zh_cn: 更新已下载，重启应用后生效

# Update_CadFailed
source: Kernel update failed
ja_jp: カーネル更新に失敗しました
zh_cn: 内核更新失败

# Update_CadMissingAsset
source: This Release does not contain an installable x64 kernel package
ja_jp: この Release にインストール可能な x64 カーネルパッケージがありません
zh_cn: 当前 Release 缺少可安装的 x64 内核包

# Update_CadCancelled
source: Kernel update cancelled
ja_jp: カーネル更新をキャンセルしました
zh_cn: 已取消内核更新

# Update_Download
source: Download update
ja_jp: 更新をダウンロード
zh_cn: 下载更新

# Update_Retry
source: Retry
ja_jp: 再試行
zh_cn: 重试

# Update_WaitingRestart
source: Waiting for restart
ja_jp: 再起動待ち
zh_cn: 等待重启

# ThreeDmLayersTitle.Text
source: Layers
ja_jp: レイヤー
zh_cn: 图层

# ThreeDmDiagnosticsBar.Title
source: Model contains import diagnostics
ja_jp: モデルに読み込み診断があります
zh_cn: 模型包含导入诊断

# ThreeDm_Status_OpeningFile
source: Opening {0}…
ja_jp: {0} を開いています…
zh_cn: 正在打开 {0}…

# ThreeDm_Status_OpeningProgress
source: Opening · {0}/{1}
ja_jp: 読み込み中 · {0}/{1}
zh_cn: 正在打开 · {0}/{1}

# ThreeDm_Status_OpenFailed
source: Unable to open the 3DM file.
ja_jp: 3DM ファイルを開けませんでした。
zh_cn: 无法打开 3DM 文件。

# ThreeDm_Status_ObjectCount
source: {0} objects
ja_jp: {0} オブジェクト
zh_cn: {0} 个对象

# ThreeDm_Unitless
source: Unitless
ja_jp: 単位なし
zh_cn: 无单位

# ThreeDm_Diagnostics_Count
source: {0} import diagnostics
ja_jp: 読み込み診断 {0} 件
zh_cn: {0} 条导入诊断

# ThreeDm_Summary
source: Objects: {0}\nLayers: {1}\nMaterials: {2}\nNamed views: {3}\nBlock definitions: {4}
ja_jp: オブジェクト：{0}\nレイヤー：{1}\nマテリアル：{2}\n名前付きビュー：{3}\nブロック定義：{4}
zh_cn: 对象：{0}\n图层：{1}\n材质：{2}\n命名视图：{3}\n块定义：{4}

# ThreeDm_Display_Shaded
source: Shaded
ja_jp: シェーディング
zh_cn: 着色

# ThreeDm_Display_ShadedWithEdges
source: Shaded with edges
ja_jp: エッジ付きシェーディング
zh_cn: 着色并显示边线

# ThreeDm_Display_Wireframe
source: Wireframe
ja_jp: ワイヤーフレーム
zh_cn: 线框
